xtee6/common-verifier/src/test/signatures/message-0.xml

<?xml version="1.0" encoding="utf-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:id="http://x-road.eu/xsd/identifiers" xmlns:sdsb="http://x-road.eu/xsd/sdsb.xsd">
    <SOAP-ENV:Header>
        <sdsb:client id:objectType="MEMBER">
            <id:sdsbInstance>EE</id:sdsbInstance>
            <id:memberClass>BUSINESS</id:memberClass>
            <id:memberCode>consumer</id:memberCode>
        </sdsb:client>
        <sdsb:service id:objectType="SERVICE">
            <id:sdsbInstance>EE</id:sdsbInstance>
            <id:memberClass>BUSINESS</id:memberClass>
            <id:memberCode>producer</id:memberCode>
            <id:serviceCode>getState</id:serviceCode>
        </sdsb:service>
        <sdsb:userId>EE:PIN:abc4567</sdsb:userId>
        <sdsb:id>0113822191372dc79b094c13c4b7e567</sdsb:id>
        <sdsb:issue/>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <sdsb:getState>aäõ</sdsb:getState>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>